### 1.	Import the pandas and load the two dataset(mark.csv and student.csv) into the pandas dataframe.

In [1]:
import pandas as pd
df1 = pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/mark.csv',header = 0)
df2 = pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/student.csv',header = 0)

### 2.	Print out the top 5 rows of df1

In [8]:
df1.head()

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi

### 3.	Print out the top 5 rows of df2

In [4]:
df2.head()

   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no

### 4.	Perform data integration to both the dataframe with respect to the column ‘Student_id’ key word ‘pd.merge()’

In [5]:
df = pd.merge(df1, df2, on = 'Student_id')

### 5.	Print out the top 5 rows of df

In [10]:
df.head()

   Student_id  Mark     City  Age  Gender      Grade Employed
0           1    95  Chennai   19    Male  1st Class      yes
1           2    70    Delhi   20  Female  2nd Class       no
2           3    98   Mumbai   18    Male  1st Class       no
3           4    75     Pune   21  Female  2nd Class       no
4           5    89    Kochi   19    Male  1st Class       no